
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоддерживаетсяСканированиеШтрихКодов = Ложь;
	
	#Если МобильноеПриложениеКлиент Тогда
	ПоддерживаетсяСканированиеШтрихКодов = СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов();
	#КонецЕсли
	
	Элементы.СоздатьИзQR.Видимость = ПоддерживаетсяСканированиеШтрихКодов;
	
КонецПроцедуры	

#Если МобильноеПриложениеКлиент Тогда
&НаКлиенте
Процедура СоздатьИзQR(Команда)

	ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Наведите камеру на штрихкод", ОбработчикСканирования);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		Текст = "" + Штрихкод;
	Иначе
		Текст = "Ошибка: " + Сообщение;
	КонецЕсли;
	
	СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	
	Сообщить(Текст);
	
КонецПроцедуры
#КонецЕсли
