
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Абонемент") Тогда
		
		Абонемент = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДоступныеУслуги.Записывать = Истина;
	
	Запись = Движения.ДоступныеУслуги.ДобавитьРасход();
	Запись.Период = Дата;
	Запись.Абонемент = Абонемент;
	Запись.Количество = 1;
	
КонецПроцедуры
